[Readme]

 - Linux "stat.txt" 파일을 CSV 형식으로 변환하는 프로그램
 - 리눅스 서버에서  find / -exec stat '{ }' \; >> meta.txt 명령어를 사용하여 얻어진 텍스트 파일을 .csv로 변환합니다.

   - 1. 실행 전, "linux_stat_parser.exe" 을 "stat.txt" 와 같은 디렉토리에 위치합니다.
   - 2. 터미널(cmd)을 실행하여 해당 프로그램을 실행합니다.


 [명령어 옵션 설명] 
 
  -h, --help         도움말 출력

  -p, --progress     진행 상황 표시
			 -> 파일의 크기가 큰 경우 시간이 오래 걸릴 수 있으므로 진행률을 표시합니다.
			 -> 해당 옵션 생략 시, 진행률이 보이지 않습니다.

  -d, --directory    파일 경로 및 파일명을 하나로 처리할지 결정하는 옵션입니다.
			-> 해당 옵션을 명시할 경우, File, Directory 필드로 생성됩니다. (파일경로, 파일명을 필드로 구분됨)
			-> 해당 옵션을 생략할 경우, File 필드로 생성됩니다. (파일경로 및 파일명을 하나의 필드로 사용됨)

  -U --UTC  	UTC 시간 오프셋을 계산 (예: +9 또는 -9)
			-> linux의 경우 UTC+0 로 저장되는 경우가 있어 UTC 계산 옵션을 추가하였습니다.


[명령어 예시]
  - linux_stat_to_csv.exe -pd -U +9 stat.txt

 [실행 결과]
   - "stat_output.csv" 의 이름으로 생성됩니다. "TimelineExplorer.exe"에 로드하여 사용합니다.  
   - 시간과 관련된 필드를 필터를 사용해 타임라인을 쉽게 볼 수 있습니다.
